---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LeaderRightAttachment
source: html/3e28ffe1-bae9-6826-9042-285f9bfd98fe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LeaderRightAttachment Property

"Right Attachment"

## Syntax (C#)
```csharp
public static ForgeTypeId LeaderRightAttachment { get; }
```